docs/doc/contributing.html
---
layout: page
title: Contributing
---

<script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML" type="text/javascript"></script>

<p>
This page documents how to download/setup the project and contribute
to the <a href="https://github.com/YouHoo0521/kaggle-march-madness-men-2019">project Github</a>. 
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd0d50c2">1. Setup</a>
<ul>
<li><a href="#org23ebe6f">1.1. Clone the Github repo locally</a></li>
<li><a href="#org3e1bce9">1.2. Set up virtual environment</a></li>
<li><a href="#org482b19f">1.3. Install the project package</a></li>
</ul>
</li>
<li><a href="#orge986943">2. Develop</a></li>
<li><a href="#org16f0121">3. Push Changes</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd0d50c2" class="outline-2">
<h2 id="orgd0d50c2"><span class="section-number-2">1</span> Setup</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org23ebe6f" class="outline-3">
<h3 id="org23ebe6f"><span class="section-number-3">1.1</span> Clone the Github repo locally</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li><p>
Copy the project into a local directory called <code>kaggle-march-madness-men-2019/</code>.
</p>
<pre class="example">
git clone https://github.com/YouHoo0521/kaggle-march-madness-men-2019.git
</pre></li>

<li><p>
Move into the directory.
</p>
<pre class="example">
cd kaggle-march-madness-men-2019
</pre></li>
</ol>
</div>
</div>

<div id="outline-container-org3e1bce9" class="outline-3">
<h3 id="org3e1bce9"><span class="section-number-3">1.2</span> Set up virtual environment</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li><p>
Create a new virtual environment called <code>march-madness</code>. Do this once.
</p>
<pre class="example">
virtualenv venv/march-madness --python=python3.6
</pre></li>

<li><p>
Activate the virtual environment. Do this before every session.
</p>
<pre class="example">
source venv/march-madness/bin/activate
</pre></li>

<li><p>
Install required Python packages into the virtual environment. Do
this every time <code>requirements.txt</code> file changes.
</p>
<pre class="example">
pip3 install -r requirements.txt
</pre>
<ul class="org-ul">
<li>Update <code>requirements.txt</code> if the source code requires new packages.</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org482b19f" class="outline-3">
<h3 id="org482b19f"><span class="section-number-3">1.3</span> Install the project package</h3>
<div class="outline-text-3" id="text-1-3">
<p>
This project is organized as a Python package. We can write the source
code in <code>src/</code> directory and import it from elsewhere, such as in
<code>notebook/</code>.
</p>

<p>
We can install the package (into our virtual environment) in
development mode so that the changes we make to the source can be used
immediately.
</p>
<pre class="example">
python setup.py develop
</pre>

<p>
At this point, we can import our package from anywhere by calling:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">import</span> src                                           <span style="color: #b22222;"># </span><span style="color: #b22222;">import entire package</span>
<span style="color: #a020f0;">from</span> src.data <span style="color: #a020f0;">import</span> make_dataset                    <span style="color: #b22222;"># </span><span style="color: #b22222;">import a module</span>
<span style="color: #a020f0;">from</span> src.data.make_dataset <span style="color: #a020f0;">import</span> get_train_data_v1  <span style="color: #b22222;"># </span><span style="color: #b22222;">import a function</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orge986943" class="outline-2">
<h2 id="orge986943"><span class="section-number-2">2</span> Develop</h2>
<div class="outline-text-2" id="text-2">
<p>
By default, <code>git</code> will point to <code>master</code> branch, which is the
production version. We want to develop in a separate branch and merge
the changes back to master.
</p>

<ol class="org-ol">
<li><p>
Confirm that you're in local <code>master</code> branch.
</p>
<pre class="example">
git status
</pre>
<p>
The first line should say <code>On branch master</code>. If not, run
</p>
<pre class="example">
git checkout master
</pre></li>
<li><p>
Pull the latest updates from <code>origin/master</code> branch. <code>origin</code>
refers to the remote repo on Github, which is the official version
of our code.
</p>
<pre class="example">
git pull origin master
</pre></li>
<li><p>
Create and checkout a new branch off of <code>master</code>. The following
command is a shortcut for creating a new branch called
<code>dev_logistic_regression</code> and moving into it.
</p>
<pre class="example">
git checkout -b dev_logistic_regression
</pre></li>
<li>Write code.
<ul class="org-ul">
<li>Put reusable code in <code>src/</code> directory</li>
<li>Put exploratory analysis in <code>notebooks/</code> directory</li>
<li>Put scripts in <code>bin/</code> directory
<ul class="org-ul">
<li>e.g command line scripts for ML pipeline (data prep, training, cross-validation, evaluation)</li>
</ul></li>
</ul></li>
<li><p>
Stage changed files for commit.
</p>
<pre class="example">
git add new_file_name
git add modified_file_name
git add deleted_file_name
</pre></li>
<li><p>
Commit changes locally.
</p>
<pre class="example">
git commit -m "Write message here."
</pre></li>
</ol>
</div>
</div>

<div id="outline-container-org16f0121" class="outline-2">
<h2 id="org16f0121"><span class="section-number-2">3</span> Push Changes</h2>
<div class="outline-text-2" id="text-3">
<p>
When your code is ready to be checked in (after one or more local
commits), you can push your local branch onto Github repo and submit a
pull-request.
</p>
<ol class="org-ol">
<li><p>
Push your local branch (e.g. <code>dev_logistic_regression</code>) to
Github. This will create <code>origin/dev_logistic_regression</code> branch.
</p>
<pre class="example">
git push origin dev_logistic_regression
</pre></li>

<li>Go to <a href="https://github.com/YouHoo0521/kaggle-march-madness-men-2019">project Github</a>, navigate to your new branch, and click <code>new
   pull request</code>.</li>
</ol>
</div>
</div>
